In [360]:
import numpy as np
import pandas as pd
import random

import warnings
warnings.filterwarnings('ignore')# warning maessage를 보고 싶지 않으면

In [361]:
s1 = pd.Series([31,34,37,32],
            index = ['서울', '부산', '인천', '대구'])
s2 = pd.Series([20,22,25,21],
            index = ['서울', '부산', '인천', '제주'])

In [362]:
s1

서울    31
부산    34
인천    37
대구    32
dtype: int64

In [363]:
s2

서울    20
부산    22
인천    25
제주    21
dtype: int64

In [364]:
s3 = s1-s2
s3

대구     NaN
부산    12.0
서울    11.0
인천    12.0
제주     NaN
dtype: float64

In [365]:
s3.dropna().astype(int)

부산    12
서울    11
인천    12
dtype: int32

In [366]:
s3.isna().sum()

2

In [367]:
s1*s2

대구      NaN
부산    748.0
서울    620.0
인천    925.0
제주      NaN
dtype: float64

In [368]:
data = {
    '사과': ['수 ',81,92,53,1.1],
    '배': ['부',35,15,87,2.2],
    '귤': ['구',15,45,78,3.3],
    '감': ['구',54,68,79,4.4],
    '수박': ['수',75,89,35,5.5],
    }
    
index = ['글','마트','인터넷','집','몰라']
df = pd.DataFrame(data, index=index)
df

      사과    배    귤    감   수박
글     수     부    구    구    수
마트    81   35   15   54   75
인터넷   92   15   45   68   89
집     53   87   78   79   35
몰라   1.1  2.2  3.3  4.4  5.5

In [369]:
df.T

     글  마트 인터넷   집   몰라
사과  수   81  92  53  1.1
배    부  35  15  87  2.2
귤    구  15  45  78  3.3
감    구  54  68  79  4.4
수박   수  75  89  35  5.5

In [370]:
data = {
    "국어": [80, 90, 70, 30],
    "영어": [90, 70, 60, 40],
    "수학": [90, 60, 80, 70],
}
columns = ["국어", "영어", "수학"]
index = ["춘향", "몽룡", "향단", "방자"]
df = pd.DataFrame(data, index=index, columns=columns)
df

    국어  영어  수학
춘향  80  90  90
몽룡  90  70  60
향단  70  60  80
방자  30  40  70

In [371]:
df['수학']

춘향    90
몽룡    60
향단    80
방자    70
Name: 수학, dtype: int64

In [372]:
df[['국어','영어']]

    국어  영어
춘향  80  90
몽룡  90  70
향단  70  60
방자  30  40

In [373]:
df['평균'] = df.mean(1).round(2)

In [374]:
df

    국어  영어  수학     평균
춘향  80  90  90  86.67
몽룡  90  70  60  73.33
향단  70  60  80  70.00
방자  30  40  70  46.67

In [375]:
df['평균2'] = np.mean(df.values[:,:-1], axis = 1).round(2)
df

    국어  영어  수학     평균    평균2
춘향  80  90  90  86.67  86.67
몽룡  90  70  60  73.33  73.33
향단  70  60  80  70.00  70.00
방자  30  40  70  46.67  46.67

In [376]:
df.drop(columns = ['평균','평균2'], inplace = True)
df

    국어  영어  수학
춘향  80  90  90
몽룡  90  70  60
향단  70  60  80
방자  30  40  70

In [377]:
df['영어']['방자'] = 80
df

    국어  영어  수학
춘향  80  90  90
몽룡  90  70  60
향단  70  60  80
방자  30  80  70

In [378]:
df['평균'] = df.mean(1).round(2)

In [379]:
df

    국어  영어  수학     평균
춘향  80  90  90  86.67
몽룡  90  70  60  73.33
향단  70  60  80  70.00
방자  30  80  70  60.00

In [380]:
df[:'춘향']

    국어  영어  수학     평균
춘향  80  90  90  86.67

In [381]:
df.head(1)

    국어  영어  수학     평균
춘향  80  90  90  86.67

In [382]:
df.T[['춘향']]

       춘향
국어  80.00
영어  90.00
수학  90.00
평균  86.67

In [383]:
df.head(3).tail(1) #향단뽑기

    국어  영어  수학    평균
향단  70  60  80  70.0

In [384]:
df

    국어  영어  수학     평균
춘향  80  90  90  86.67
몽룡  90  70  60  73.33
향단  70  60  80  70.00
방자  30  80  70  60.00

In [385]:
df.loc['향단']

국어    70.0
영어    60.0
수학    80.0
평균    70.0
Name: 향단, dtype: float64

In [386]:
df.T['향단']

국어    70.0
영어    60.0
수학    80.0
평균    70.0
Name: 향단, dtype: float64

In [387]:
df = pd.DataFrame(np.arange(10, 22).reshape(3, 4),
                  index=["a", "b", "c"],
                  columns=["A", "B", "C", "D"])
df

    A   B   C   D
a  10  11  12  13
b  14  15  16  17
c  18  19  20  21

In [388]:
df = pd.DataFrame(np.arange(25).reshape(5,5), columns=list('ABCDE') , index = list('vwxyz'))
df

    A   B   C   D   E
v   0   1   2   3   4
w   5   6   7   8   9
x  10  11  12  13  14
y  15  16  17  18  19
z  20  21  22  23  24

In [389]:
df['C']['x'],df['C'][2],df.C['x'],df.C[2],df.C.x

(12, 12, 12, 12, 12)

In [390]:
df.loc['x','C'],df.loc['x'][2],df.loc['x']['C']

(12, 12, 12)

In [391]:
df.iloc[2,2], df.iloc[2]['C'],df.iloc[2][2]

(12, 12, 12)

In [392]:
df = pd.DataFrame(np.random.randint(1,100,25).reshape(5,5),
                index = ['a','b','c','d','e'],
                columns =['가','나','다','라','마'])
df

    가   나   다   라   마
a  51   4  75  94  21
b  83  38  20   9  45
c  91  42  34  35  74
d  37  59  31  19  77
e  11  37  46  97  43

In [393]:
df['가'],df.가

(a    51
 b    83
 c    91
 d    37
 e    11
 Name: 가, dtype: int32,
 a    51
 b    83
 c    91
 d    37
 e    11
 Name: 가, dtype: int32)

In [394]:
df.loc[:][:]

    가   나   다   라   마
a  51   4  75  94  21
b  83  38  20   9  45
c  91  42  34  35  74
d  37  59  31  19  77
e  11  37  46  97  43

In [395]:
df.loc[:][1::2]

    가   나   다   라   마
b  83  38  20   9  45
d  37  59  31  19  77

In [396]:
df.iloc[::][::4]

    가   나   다   라   마
a  51   4  75  94  21
e  11  37  46  97  43

In [397]:
df['가']['a']

51

In [398]:
df2=df[['가','나','마']]*df.loc[['a','b','d']]
df2

        가       나   다   라       마
a  2601.0    16.0 NaN NaN   441.0
b  6889.0  1444.0 NaN NaN  2025.0
c     NaN     NaN NaN NaN     NaN
d  1369.0  3481.0 NaN NaN  5929.0
e     NaN     NaN NaN NaN     NaN

In [399]:
df.loc[['a','b','d'],['가','나','마']]

    가   나   마
a  51   4  21
b  83  38  45
d  37  59  77

In [400]:
df.loc['a']

가    51
나     4
다    75
라    94
마    21
Name: a, dtype: int32

NameError: name 'array' is not defined